<!DOCTYPE HTML>
<!--
	Minimaxing by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)
--><html lang="fr">
	<head>

		<title>L'&eacute;quipe - LIF</title>
<meta charset="utf-8">
<meta name="description" content="FOO">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="robots" content="index,follow">
<link rel="icon" href="images/cropped-lif-carre-1024.png" type="image/png">		<link rel="stylesheet" href="assets/css/main.css">
		<link rel="stylesheet" href="custom.css">
	</head>
	<body>
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">

								<header id="header">
																	<h1><a href="index" id="logo"><span style="display:none">LIF</span></a></h1>
									<nav id="nav">
										<a href="index">Accueil</a>
										<a href="recherche">Recherche</a>
										<a href="membres" class="current-page-item">Membres</a>
										<a href="posts/liste">Nouvelles</a>
										<a href="contact-fr">Contact</a>
										<a href="staff">English</a>
									</nav>
																</header>

							</div>
						</div>
					</div>
				</div>
			<!-- Main -->
				<div id="main">
				  <div class="container">
						<div class="row main-row">
							<div class="col-12 col-12-medium col-12-small postcontent">
								<section>
								    



<h1>L'&eacute;quipe</h1>

<p>Quatre professeurs-chercheurs sont membres du LIF et y supervisent une dizaine d'&eacute;tudiants de tous les cycles. Au total, depuis sa cr&eacute;ation, le LIF a vu passer plus d'une soixantaine d'&eacute;tudiants venant du Qu&eacute;bec, de France, de Chine et d'Afrique.</p>

<h2>Professeurs</h2>

<p><img src="images/shalle.webp" alt="Photo Sylvain Hall&eacute;" class="floatphoto"> <strong>Sylvain Hall&eacute;</strong>, Ph.D. est titulaire de la Chaire de recherche du Canada en sp&eacute;cification, test et v&eacute;rification de syst&egrave;mes informatiques et professeur titulaire au D&eacute;partement d'informatique et de math&eacute;matique de l'UQAC, o&ugrave; il travaille depuis 2010. Auparavant, il a obtenu un doctorat en informatique de l'UQAM et a travaill&eacute; comme chercheur postdoctoral &agrave; l'University of California, Santa Barbara, de 2008 &agrave; 2010. Le Pr. Hall&eacute; est le r&eacute;cpiendaire de nombreux prix internationaux pour ses recherches sur le test et la v&eacute;rification d'applications, et s'est m&eacute;rit&eacute; deux M&eacute;dailles acad&eacute;miques du Gouverneur g&eacute;n&eacute;ral du Canada, l'une en 1997 et l'autre en 2009.</p>

<div style="clear:both"></div>

<p><img src="images/FehmiJaafar-300.webp" alt="Photo Fehmi Jaafar" class="floatphoto"> <strong>Fehmi Jaafar</strong>, Ph.D. est professeur agr&eacute;g&eacute; &agrave; l'Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi et professeur associ&eacute; &agrave; l'Universit&eacute; Concordia et l'Universit&eacute; Laval. Il est le vice-pr&eacute;sident du comit&eacute; sur l'Internet des objets et technologies connexes au Conseil canadien des normes. Auparavant, il &eacute;tait un chercheur au Centre de recherche en Informatique de Montr&eacute;al (CRIM), professeur adjoint &agrave; l'Universit&eacute; Concordia d'Edmonton, et chercheur postdoctoral &agrave; Queen's University et &agrave; Polytechnique Montr&eacute;al. Apr&egrave;s avoir obtenu un doctorat en informatique de l'Universit&eacute; de Montr&eacute;al, le Pr. Jaafar s'est sp&eacute;cialis&eacute; dans des travaux de recherche en cybers&eacute;curit&eacute;. Il s'int&eacute;resse &agrave; la cybers&eacute;curit&eacute; dans l'Internet des objets et &agrave; l'application des techniques d'apprentissage automatique en cybers&eacute;curit&eacute;. Il a &eacute;tabli des programmes de recherche en collaboration avec D&eacute;fense Canada, S&eacute;curit&eacute; publique Canada, le Conseil de recherches en sciences naturelles et en g&eacute;nie du Canada, et des partenaires industriels et universitaires canadiens et &eacute;trangers.</p>

<div style="clear:both"></div>

<p><img src="images/Hugo_300.jpg" alt="Photo Hugo Tremblay" class="floatphoto"> <strong>Hugo Tremblay</strong>, Ph.D. est professeur adjoint au D&eacute;partement d'informatique et de math&eacute;matique de l'UQAC depuis 2022. Il a obtenu son doctorat en math&eacute;matique &agrave; l'UQ&Agrave;M en 2017 avant de travailler comme chercheur postdoctoral &agrave; l'Universit&eacute; d'Ottawa, puis comme professeur substitut &agrave; l'UQAC. Ses travaux de recherche se concentrent en g&eacute;om&eacute;trie digitale, en th&eacute;orie des graphes et en algorithmique.</p>

<div style="clear:both"></div>

<p><img src="images/sgaboury.webp" alt="Photo S&eacute;bastien Gaboury" class="floatphoto">  <strong>S&eacute;bastien Gaboury</strong>, Ph.D. est professeur agr&eacute;g&eacute; au D&eacute;partement d'informatique et de math&eacute;matique de l'UQAC depuis 2012. Il est l'auteur de pr&egrave;s d'une centaine de publications scientifiques dans des journaux et des conf&eacute;rences internationales. Le Pr. Gaboury &eacute;tait en 2013 le r&eacute;cipiendaire d'une M&eacute;daille acad&eacute;mique du Gouverneur g&eacute;n&eacute;ral du Canada pour ses travaux de doctorat en math&eacute;matiques fondamentales.</p>

<div style="clear:both"></div>

<h2>&Eacute;tudiants</h2>

<p>La contribution des &eacute;tudiants au LIF est indispensable! Tous les projets de recherche et de d&eacute;veloppement qu'on y m&egrave;ne sont doubl&eacute;s d'une exp&eacute;rience p&eacute;dagogique pour les &eacute;tudiants qui y participent.</p>

<h3>&Eacute;tudiants au doctorat</h3>

<ul>
<li>Ricardo &Aacute;vila</li>
<li>Sarika Machhindra Kadam</li>
<li>Eduardo Mendes de Oliveira</li>
<li>Mithunvenkatesh Mohankumar</li>
<li>Marcela Santos</li>
</ul>

<h3>&Eacute;tudiants &agrave; la ma&icirc;trise</h3>

<ul>
<li>Alexandre Lambert</li>
<li>Amadou Kabin&eacute; Traore</li>
</ul>

<h3>&Eacute;tudiants de premier cycle</h3>

<ul>
<li>V&eacute;ronique Du Paul, bourse de recherche de premier cycle du CRSNG</li>
<li>Sophie Lalancette, bourse de recherche de premier cycle du CRSNG</li>
<li>Baptiste Wetterwald</li>
<li>Alexander Yanovskyy</li>
</ul>

<h2>Anciens &eacute;tudiants</h2>

<p>Merci &agrave; tous nos anciens &eacute;tudiants depuis la cr&eacute;ation du laboratoire en 2012. (Contactez-nous si votre statut a chang&eacute; ou si on vous a oubli&eacute;!)</p>

<h3>&Eacute;tudiants au doctorat</h3>

<ul>
<li>Oussama Beroual</li>
<li>Quentin Betti</li>
<li>Edmond La Chance</li>
<li>Bianca Minetto Napole&atilde;o</li>
<li>&Eacute;ric Lunaud Ngoup&eacute;</li>
<li>Jalves Nic&aacute;cio</li>
<li>Asma Razgallah</li>
<li>Massiva Roudjane</li>
<li>Rania Taleb</li>
</ul>

<h3>&Eacute;tudiants &agrave; la ma&icirc;trise (m&eacute;moires, stages et essais)</h3>

<ul>
<li>Mewena Awesso, stage de 2e cycle</li>
<li>Souhail Ben Ali, en stage chez Ubisoft</li>
<li>Mohamed Racem Boussaha</li>
<li>J&eacute;r&ocirc;me Calvar</li>
<li>Tom Canac</li>
<li>Guillaume Demarty</li>
<li>Imen Doudech</li>
<li>Ayyoub Gannoun, stage de 2e cycle</li>
<li>Francis Gu&eacute;rin</li>
<li>Dem&eacute;trio Guilard</li>
<li>Bassam Khorchani</li>
<li>Amadou Makhtar Tall</li>
<li>Fabien Maronnaud</li>
<li>Chafik Meniar</li>
<li>Aouatef Mrad</li>
<li>Mohamed Yli&egrave;s Rahim</li>
<li>Julien Roux, stage de 2e cycle</li>
<li>Lei Shi</li>
<li>Maxime Soucy-Boivin (&agrave; l'emploi du Gouvernement du Qu&eacute;bec)</li>
<li>J&eacute;r&eacute;my Spieldenner, en stage chez Eckinox M&eacute;dia</li>
<li>Youssef Achkar Touzani, stage de 2e cycle</li>
<li>Rapha&euml;l Tremblay-Lessard (&agrave; l'emploi du C&eacute;gep de Chicoutimi)</li>
<li>Jason Vallet, stage de 2e cycle</li>
<li>Simon Varvaressos, r&eacute;cipiendaire d'une bourse d'excellence du Fonds de recherche Qu&eacute;bec</li>
<li>Benjamin Vignau</li>
<li>Kun Xie</li>
</ul>

<h3>&Eacute;tudiants de premier cycle</h3>

<ul>
<li>Valentin Bailleul</li>
<li>Hello&iuml;s Barbosa</li>
<li>Gabrielle Bastien</li>
<li>Antoine Berthier</li>
<li>Nicolas Bergeron</li>
<li>Alexis Colin</li>
<li>Sarah Desmeules, bourse de recherche de premier cycle du CRSNG</li>
<li>Hans Darmstadt-B&eacute;langer, bourse de recherche de premier cycle du CRSNG</li>
<li>Vincent Dufour, bourse de recherche de premier cycle du CRSNG</li>
<li>Vincent Gagnon, bourse de recherche de premier cycle du CRSNG</li>
<li>Quentin Gouy</li>
<li>Corentin Kirscher</li>
<li>Killian Lachaux</li>
<li>Rapha&euml;l Laguerre, en &eacute;change avec T&eacute;l&eacute;com Saint-&Eacute;tienne (France)</li>
<li>Alexandre Larouche</li>
<li>Kim Lavoie, bourse de recherche de premier cycle du CRSNG; &agrave; l'emploi du C&eacute;gep de Chicoutimi</li>
<li>Gabriel Le Breton, cofondateur de Totema Studio</li>
<li>Matthieu Michenot</li>
<li>Daehli Nadeau-Otis</li>
<li>Ga&euml;l Perrot</li>
<li>Marc-Antoine Plourde, bourse de recherche de premier cycle du CRSNG</li>
<li>Martin Renaud</li>
<li>Dominic Vaillancourt, &agrave; l'emploi de Behaviour Interactive</li>
<li>Guillaume Vassal, en &eacute;change avec T&eacute;l&eacute;com Saint-&Eacute;tienne (France)</li>
<li>Benjamin Vignau</li>
</ul>

<!-- :wrap=soft: -->

								</section>
							</div>
						</div>
					</div>
				</div>

					<!-- Footer -->
				<div id="footer-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">
								<div id="copyright">
									&copy;Laboratoire d'informatique formelle. Tous droits r&eacute;serv&eacute;s. | Design: <a href="http://html5up.net">HTML5 UP</a> | Powered by <a href="https://sylvainhalle.github.io/FantasticWindmill">Fantastic Windmill</a>
								</div>

							</div>
						</div>
					</div>
				</div>

		</div>
		
		<!-- Scripts -->
<script src="assets/js/jquery.min.js"></script>
<script src="assets/js/browser.min.js"></script>
<script src="assets/js/breakpoints.min.js"></script>
<script src="assets/js/util.js"></script>
<script src="assets/js/main.js"></script>
<!-- Matomo -->
<script>
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//leduotang.ca/matomo/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '5']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
	</body>
</html>