<!DOCTYPE HTML>
<!--
	Minimaxing by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)
--><html lang="fr">
	<head>

		<title>La recherche au LIF - LIF</title>
<meta charset="utf-8">
<meta name="DC.date" content="1740227685">
<meta name="description" content="FOO">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="robots" content="index,follow">
<link rel="icon" href="images/cropped-lif-carre-1024.png" type="image/png">		<link rel="stylesheet" href="assets/css/main.css">
		<link rel="stylesheet" href="custom.css">
	</head>
	<body>
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">

								<header id="header">
																	<h1><a href="index" id="logo"><span style="display:none">LIF</span></a></h1>
									<nav id="nav">
										<a href="index">Accueil</a>
										<a href="recherche" class="current-page-item">Recherche</a>
										<a href="membres">Membres</a>
										<a href="posts/liste">Nouvelles</a>
										<a href="contact-fr">Contact</a>
										<a href="research">English</a>
									</nav>
																</header>

							</div>
						</div>
					</div>
				</div>
			<!-- Main -->
				<div id="main">
				  <div class="container">
						<div class="row main-row">
							<div class="col-12 col-12-medium col-12-small postcontent">
								<section>
								    



<h1>La recherche au LIF</h1>

<p>Le Laboratoire d&rsquo;informatique formelle (LIF) est une unit&eacute; de recherche de l&rsquo;<a href="https://www.uqac.ca">Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi</a>. Professeurs-chercheurs et &eacute;tudiants y travaillent sur des projets de recherche appliqu&eacute;e mariant les connaissances math&eacute;matiques aux syst&egrave;mes informatiques. Les projets men&eacute;s au LIF sont financ&eacute;s &agrave; la fois par des subventions publiques et des contributions de l&rsquo;industrie.</p>

<h2>Expertise</h2>

<p>Au LIF, on d&eacute;veloppe de nouvelles techniques pour d&eacute;couvrir ou emp&ecirc;cher les bugs dans les syst&egrave;mes informatiques. L&rsquo;expertise des chercheurs et des &eacute;tudiants tourne autour des axes suivants:</p>

<ul>
<li>la s&eacute;curit&eacute; informatique, particuli&egrave;rement la d&eacute;tection d&rsquo;attaques et de failles en temps r&eacute;el</li>
<li>le test et la v&eacute;rification de logiciels: comment acc&eacute;l&eacute;rer ou automatiser la recherche de bugs dans un syst&egrave;me en d&eacute;veloppement</li>
</ul>

<p>Ces grands axes sont &agrave; l&rsquo;origine de projets concrets appliqu&eacute;s aux applications web, &agrave; la gestion des r&eacute;seaux, au d&eacute;veloppement de jeux vid&eacute;o et au traitement d&rsquo;&eacute;v&eacute;nements complexes (Complex Event Processing), entre autres.</p>

<h2>Prix et reconnaissances</h2>

<p>Les &eacute;tudiants et les chercheurs du LIF m&egrave;nent une recherche de pointe qui leur a valu de nombreux prix. Dans les derni&egrave;res ann&eacute;es, trois articles scientifiques publi&eacute;s par le LIF se sont vus d&eacute;cerner le prix du Best Paper Award (meilleur article) de la conf&eacute;rence internationale o&ugrave; ils ont &eacute;t&eacute; pr&eacute;sent&eacute;s. Un des logiciels d&eacute;velopp&eacute;s au LIF a &eacute;galement gagn&eacute; le prix du Best Tool en 2015 au International Conference on Software Testing &agrave; Graz, en Autriche.</p>

<p>De plus, les &eacute;tudiants qui travaillent au LIF ont remport&eacute; dans le pass&eacute; plusieurs bourses et prix. Mentionnons une quatri&egrave;me position au D&eacute;fi Coveo Blitz et une deuxi&egrave;me position aux CS Games 2014, ainsi qu&rsquo;une multitude de bourses d&rsquo;excellence des organismes f&eacute;d&eacute;raux, comme le CRSNG et le Fonds recherche Qu&eacute;bec. Deux professeurs-chercheurs du LIF d&eacute;tiennent &eacute;galement la M&eacute;daille acad&eacute;mique du Gouverneur g&eacute;n&eacute;ral du Canada.</p>

<h2>&Eacute;quipe</h2>

<p>Fond&eacute; en 2012 par deux professeurs de l&rsquo;UQAC, le LIF n&rsquo;a cess&eacute; de grandir depuis. &Agrave; l&rsquo;heure actuelle, trois professeurs en informatique de l&rsquo;UQAC font de la recherche au LIF, o&ugrave; ils dirigent plus d&rsquo;une dizaine d&rsquo;&eacute;tudiants de niveau baccalaur&eacute;at, ma&icirc;trise et doctorat.</p>

<p>Les locaux du LIF sont situ&eacute;s &agrave; Chicoutimi (Qu&eacute;bec) au Pavillon principal de l&rsquo;UQAC. Ils peuvent accueillir jusqu&rsquo;&agrave; une quinzaine de postes de travail dans un environnement ouvert et d&eacute;contract&eacute;.</p>

								</section>
							</div>
						</div>
					</div>
				</div>

					<!-- Footer -->
				<div id="footer-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">
								<div id="copyright">
									&copy;Laboratoire d'informatique formelle. Tous droits r&eacute;serv&eacute;s. | Design: <a href="http://html5up.net">HTML5 UP</a> | Powered by <a href="https://sylvainhalle.github.io/FantasticWindmill">Fantastic Windmill</a>
								</div>

							</div>
						</div>
					</div>
				</div>

		</div>
		
		<!-- Scripts -->
<script src="assets/js/jquery.min.js"></script>
<script src="assets/js/browser.min.js"></script>
<script src="assets/js/breakpoints.min.js"></script>
<script src="assets/js/util.js"></script>
<script src="assets/js/main.js"></script>
<!-- Matomo -->
<script>
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//leduotang.ca/matomo/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '5']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
	</body>
</html>