<!DOCTYPE HTML>
<!--
	Minimaxing by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)
--><html lang="fr">
	<head>

		<title>Offre de stage ou d&rsquo;essai: Data mining appliqu&eacute; aux logs de jeux vid&eacute;o (LIF18-A3) - LIF</title>
<meta charset="utf-8">
<meta name="author" content="Sylvain Hall&eacute;">
<meta name="description" content="Le Laboratoire d&rsquo;informatique formelle sollicite les candidatures de haut calibre pour un mandat &agrave; r&eacute;aliser dans le cadre des cours 8INF859 (Stage) ou 8INF860 (Essai) de la ma&icirc;trise en informatique, profil professionnel.">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="robots" content="index,follow">
<link rel="icon" href="../../images/cropped-lif-carre-1024.png" type="image/png">		<link rel="stylesheet" href="../../assets/css/main.css">
		<link rel="stylesheet" href="../../custom.css">
	</head>
	<body>
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">

								<header id="header">
																	<h1><a href="../../index" id="logo"><span style="display:none">LIF</span></a></h1>
									<nav id="nav">
										<a href="../../index">Accueil</a>
										<a href="../../recherche">Recherche</a>
										<a href="../../membres">Membres</a>
										<a href="../../posts/liste">Nouvelles</a>
										<a href="../../contact-fr">Contact</a>
										<a href="../../posts/en/LIF18-A3">English</a>
									</nav>
																</header>

							</div>
						</div>
					</div>
				</div>
			<!-- Main -->
				<div id="main">
				  <div class="container">
						<div class="row main-row">
							<div class="col-8 col-12-medium col-12-small postcontent">
								<section>
								    



<h1>Offre de stage ou d&rsquo;essai: Data mining appliqu&eacute; aux logs de jeux vid&eacute;o (LIF18-A3)</h1>
<p class="postinfo">2019/01/08 par Sylvain Hall&eacute;</p>



<div class="noscalepostimage"><img src="../ubisoft.webp" alt="Post image"></div>




<p>Le Laboratoire d&rsquo;informatique formelle sollicite les candidatures de haut calibre pour un mandat &agrave; r&eacute;aliser dans le cadre des cours 8INF859 (Stage) ou 8INF860 (Essai) de la ma&icirc;trise en informatique, profil professionnel.</p>

<p>Dans le cadre d&rsquo;une collaboration avec Ubisoft Saguenay, le projet consiste &agrave; d&eacute;velopper et utiliser des algorithmes de data mining appliqu&eacute;s aux logs d&rsquo;ex&eacute;cution provenant de sources diverses. Le projet implique l&rsquo;&eacute;tude d&rsquo;algorithmes de data mining, l&rsquo;&eacute;laboration d&rsquo;hypoth&egrave;ses de recherche, le d&eacute;veloppement d&rsquo;une preuve de concept et sa validation au moyen de donn&eacute;es synth&eacute;tiques et r&eacute;elles.</p>

<p>Le stage se d&eacute;roulera dans les locaux d&rsquo;UbiSoft Saguenay, et implique la participation d&rsquo;une &eacute;quipe de chercheurs du Laboratoire d&rsquo;informatique formelle (http://liflab.ca) de l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi (http://www.uqac.ca), sous l&rsquo;&eacute;gide de la Chaire de recherche du Canada en sp&eacute;cification, test et v&eacute;rification de syst&egrave;mes. Le LIF est entre autres reconnu pour le d&eacute;veloppement de BeepBeep, une librairie de traitement de flux d&rsquo;&eacute;v&eacute;nements et d&rsquo;analyse de logs open source qui a &eacute;t&eacute; appliqu&eacute;e &agrave; de nombreux probl&egrave;mes informatiques concrets, allant de la d&eacute;tection de bugs dans les jeux vid&eacute;o &agrave; la v&eacute;rification de sp&eacute;cifications formelles dans des logs de sources diverses.</p>

<h2>Principaux mandats du stagiaire</h2>

<ul>
<li>Participer aux diff&eacute;rentes phases du d&eacute;veloppement logiciel en &eacute;tant int&eacute;gr&eacute; au sein d&rsquo;une &eacute;quipe</li>
<li>Approfondir des comp&eacute;tences techniques et fonctionnelles dans le domaine du data mining et du complex event processing</li>
<li>Contribuer &agrave; la qualit&eacute; des solutions et au respect des bonnes pratiques</li>
<li>Ma&icirc;triser un code de qualit&eacute; gr&acirc;ce aux techniques de Test Driven Development et d&rsquo;int&eacute;gration continue</li>
<li>Documenter son travail afin de transf&eacute;rer ses connaissances aux autres membres de l&rsquo;&eacute;quipe</li>
</ul>

<h2>Qualifications requises</h2>

<ul>
<li>&Ecirc;tre inscrit &agrave; l&rsquo;UQAC dans un programme de deuxi&egrave;me cycle (ma&icirc;trise profil recherche ou profil professionnel)</li>
<li>Excellente aptitude &agrave; la programmation</li>
<li>Conaissance des principes et des algorithmes de base du data mining (clustering, apprentissage)</li>
<li>Une connaissance de la librairie Weka serait un atout</li>
<li>Aptitude &agrave; la r&eacute;daction de textes techniques, en fran&ccedil;ais et en anglais</li>
</ul>

<h2>Technologies utilis&eacute;es</h2>

<ul>
<li>Ma&icirc;trise de Python, Elastic Search, Scikit</li>
<li>Une connaissance du C++, Pytorch, Golang, R est un atout</li>
</ul>

<h2>Dur&eacute;e</h2>

<p>6 mois</p>

<h2>Date de d&eacute;but</h2>

<p>Entre f&eacute;vrier et juillet 2019. Le stage peut d&eacute;buter durant la session d&rsquo;hiver, et l&rsquo;horaire de travail am&eacute;nag&eacute; en fonction de la charge de travail jusqu&rsquo;&agrave; la fin des cours.</p>

<h2>R&eacute;mun&eacute;ration</h2>

<p>15 000$</p>

<h2>Lieu du stage</h2>

<p>Le temps de travail sera partag&eacute; entre les bureaux d&rsquo;Ubisoft Saguenay et le Laboratoire d&rsquo;informatique formelle de l&rsquo;UQAC.</p>

<p>Ubisoft Saguenay est le prochain chapitre dans la vie d&rsquo;Ubisoft au Qu&eacute;bec, avec une ouverture r&eacute;cente le 9 f&eacute;vrier 2018 &agrave; Chicoutimi. Lorsque vous vous joignez &agrave; Ubisoft, vous entrez dans une communaut&eacute; de d&eacute;veloppeurs exceptionnels reli&eacute;s par leur besoin d&rsquo;innover, d&rsquo;&ecirc;tre cr&eacute;atifs, et de travailler avec les technologies de pointe. Vous d&eacute;couvrirez un monde o&ugrave; les employ&eacute;s b&eacute;n&eacute;ficient d&rsquo;un avancement professionnel constant, d&rsquo;un cadre d&rsquo;apprentissage accueillant et de r&eacute;gimes de r&eacute;mun&eacute;ration concurrentiels. Plus que tout, vous travaillerez sur un grand nombre de titres d&rsquo;envergure et de grande qualit&eacute; avec certains des plus grands talents de l&rsquo;industrie, en collaboration avec les studios canadiens d&rsquo;Ubisoft.</p>

<p>Le LIF est une unit&eacute; de recherche de l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi. Quatre professeurs-chercheurs et plus d&rsquo;une dizaine d&rsquo;&eacute;tudiants de tous les cycles y travaillent sur des projets de recherche appliqu&eacute;e tournant autour du test, de la v&eacute;rification et de la s&eacute;curit&eacute;. Les projets men&eacute;s au LIF sont financ&eacute;s &agrave; la fois par des subventions publiques et des contributions de l&rsquo;industrie; quelques r&eacute;cents partenaires industriels du LIF sont BlooBuzz, Hydro-Qu&eacute;bec, Novum Solutions, Omnimed et Ericsson Canada. Le LIF dispose d&rsquo;installations modernes au Pavillon principal de l&rsquo;UQAC et a cumul&eacute; plus d&rsquo;un million de dollars en fonds de recherche de toutes provenances depuis sa cr&eacute;ation.</p>

<h2>Pour postuler</h2>

<p>Les candidatures doivent &ecirc;tre achemin&eacute;es au professeur Rapha&euml;l Khoury (rkhoury@uqac.ca) en mentionnant comme sujet &laquo;LIF18-A3&raquo;. Les demandes doivent inclure:</p>

<ul>
<li>Un CV &agrave; jour</li>
<li>Un relev&eacute; de notes</li>
<li>Une lettre de motivation</li>
<li>Les noms et coordonn&eacute;es d&rsquo;au moins deux r&eacute;pondants</li>
</ul>

<p>Les demandes seront trait&eacute;es au fur et &agrave; mesure de leur r&eacute;ception jusqu&rsquo;&agrave; ce qu&rsquo;un candidat soit s&eacute;lectionn&eacute;. Les dossiers incomplets seront rejet&eacute;s sans pr&eacute;avis.</p>

<!-- :wrap=soft: -->

								</section>
							</div>
							<div class="col-4 col-12-medium col-12-small">
								<section>
									<h2>Publications r&eacute;centes</h2>
									<ul class="postlist">
<li>
<a href="../posts/fr/LIF25-M1">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: &Eacute;valuation des comp&eacute;tences cliniques par le monitoring et l&rsquo;analyse de logs (LIF25-M1)</a><br>
<span class="postinfo">2025/02/07 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-D4">Candidats au doctorat recherch&eacute;s: Suivi de la gestion de projet d'un jeu vid&eacute;o par l'analyse des fichiers de journalisation (LIF24-D4)</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24">&Eacute;tudiants recherch&eacute;s pour plusieurs projets de ma&icirc;trise et de doctorat</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-D3">Candidats au doctorat recherch&eacute;s: D&eacute;tection d&rsquo;anomalies dans un syst&egrave;me de requ&ecirc;tes d&rsquo;identit&eacute; (LIF24-D3)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-M1">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: Monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o (LIF24-M1)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
</ul>

								</section>
															</div>
						</div>
					</div>
				</div>

					<!-- Footer -->
				<div id="footer-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">
								<div id="copyright">
									&copy;Laboratoire d'informatique formelle. Tous droits r&eacute;serv&eacute;s. | Design: <a href="http://html5up.net">HTML5 UP</a> | Powered by <a href="https://sylvainhalle.github.io/FantasticWindmill">Fantastic Windmill</a>
								</div>

							</div>
						</div>
					</div>
				</div>

		</div>
		
		<!-- Scripts -->
<script src="../../assets/js/jquery.min.js"></script>
<script src="../../assets/js/browser.min.js"></script>
<script src="../../assets/js/breakpoints.min.js"></script>
<script src="../../assets/js/util.js"></script>
<script src="../../assets/js/main.js"></script>
<!-- Matomo -->
<script>
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//leduotang.ca/matomo/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '5']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
	</body>
</html>