<!DOCTYPE HTML>
<!--
	Minimaxing by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)
--><html lang="fr">
	<head>

		<title>Offre de stage de ma&icirc;trise en assurance qualit&eacute; web chez Eckinox (LIF21-E1) - LIF</title>
<meta charset="utf-8">
<meta name="author" content="Sylvain Hall&eacute;">
<meta name="description" content="Des candidats sont recherch&eacute;s pour un stage de ma&icirc;trise en d&eacute;veloppement web et assurance qualit&eacute;.">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="robots" content="index,follow">
<link rel="icon" href="../../images/cropped-lif-carre-1024.png" type="image/png">		<link rel="stylesheet" href="../assets/css/main.css">
		<link rel="stylesheet" href="../custom.css">
	</head>
	<body>
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">

								<header id="header">
																	<h1><a href="../../index" id="logo"><span style="display:none">LIF</span></a></h1>
									<nav id="nav">
										<a href="../../index">Accueil</a>
										<a href="../../recherche">Recherche</a>
										<a href="../../membres">Membres</a>
										<a href="../../posts/liste">Nouvelles</a>
										<a href="../../contact-fr">Contact</a>
										<a href="../../posts/en/LIF21-E1">English</a>
									</nav>
																</header>

							</div>
						</div>
					</div>
				</div>
			<!-- Main -->
				<div id="main">
				  <div class="container">
						<div class="row main-row">
							<div class="col-8 col-12-medium col-12-small postcontent">
								<section>
								    



<h1>Offre de stage de ma&icirc;trise en assurance qualit&eacute; web chez Eckinox (LIF21-E1)</h1>
<p class="postinfo">2021/04/19 par Sylvain Hall&eacute;</p>



<div class="postimage"><img src="../eckinox-montage.webp" alt="Post image"></div>




<h2>Titre</h2>

<p>D&eacute;veloppement d&rsquo;outils d&rsquo;assurance qualit&eacute; pour le processus de d&eacute;veloppement d&rsquo;un site web</p>

<h2>D&eacute;tails du projet</h2>

<ul>
<li>Client&egrave;le vis&eacute;e: finissants de ma&icirc;trise devant effectuer un stage de fin d&rsquo;&eacute;tude ou un essai</li>
<li>Nombre de postes &agrave; pourvoir: 2</li>
<li>Dur&eacute;e: 6 mois</li>
<li>R&eacute;mun&eacute;ration: bourse d&rsquo;&eacute;tudes de 10000$</li>
<li>D&eacute;but du projet: &eacute;t&eacute; 2021 (flexible)</li>
</ul>

<h2>Pour postuler</h2>

<p>Contacter directement <a href="../contact-fr">Sylvain Hall&eacute;</a> en fournissant:</p>

<ul>
<li>une lettre de pr&eacute;sentation mentionnant le num&eacute;ro du stage (LIF21-E1)</li>
<li>un relev&eacute; de notes r&eacute;cent</li>
<li>un curriculum vitae &agrave; jour</li>
</ul>

<h2>Contexte du projet</h2>

<p>Dans le cadre d&rsquo;une collaboration avec Eckinox, une agence sp&eacute;cialis&eacute;e en web, design, vid&eacute;o et marketing, le projet consiste &agrave; d&eacute;velopper des applications web et &agrave; int&eacute;grer de nouvelles fonctionnalit&eacute;s &agrave; un outil automatis&eacute; de test d&rsquo;interfaces graphiques, qui s&rsquo;appelle Koalati (https://koalati.com). Depuis plus d&rsquo;un an, une &eacute;quipe de chercheurs du Laboratoire d&rsquo;informatique formelle de l&rsquo;UQAC et de stagiaires ont commenc&eacute; la cr&eacute;ation d&rsquo;une extension du logiciel permettant de d&eacute;tecter la violation de conditions dans une page web et d&rsquo;expliquer ces violations de mani&egrave;re automatis&eacute;e. Des exp&eacute;riences men&eacute;es r&eacute;cemment chez Eckinox ont confirm&eacute; l&rsquo;int&eacute;r&ecirc;t de l&rsquo;entreprise &agrave; utiliser ce logiciel dans leur processus de d&eacute;veloppement &agrave; des fins de veille et de contr&ocirc;le de qualit&eacute; des sites qu&rsquo;elle produit.</p>

<p>Le projet est financ&eacute; par une subvention Mitacs Acc&eacute;l&eacute;ration. L&rsquo;&eacute;tudiant sera r&eacute;mun&eacute;r&eacute; sour la forme d&rsquo;une bourse d&rsquo;&eacute;tudes pour la dur&eacute;e de son stage (ou essai).</p>

<h2>Principaux mandats</h2>

<ul>
<li>Participer aux diff&eacute;rentes phases de d&eacute;veloppement web en &eacute;tant int&eacute;gr&eacute; au sein d&rsquo;une &eacute;quipe</li>
<li>Approfondir des comp&eacute;tences techniques et fonctionnelles dans le domaine du test et de la v&eacute;rification automatiques</li>
<li>Contribuer au d&eacute;veloppement du logiciel Cornipickle par l&rsquo;ajout de nouvelles fonctionnalit&eacute;s propos&eacute;es par l&rsquo;entreprise</li>
<li>R&eacute;diger des scripts de test au moyen du logiciel, et les appliquer aux sites en cours de d&eacute;veloppement</li>
<li>Ma&icirc;triser un code de qualit&eacute; gr&acirc;ce aux techniques de Test Driven Development et d&rsquo;int&eacute;gration continue</li>
<li>Documenter son travail afin de transf&eacute;rer ses connaissances aux autres membres de l&rsquo;&eacute;quipe</li>
</ul>

<h2>Qualifications requises</h2>

<ul>
<li>&Ecirc;tre inscrit &agrave; l&rsquo;UQAC dans un programme de deuxi&egrave;me cycle (ma&icirc;trise profil recherche ou profil professionnel)</li>
<li>Excellente aptitude &agrave; la programmation, particuli&egrave;rement HTML/CSS, JavaScript et Node.js</li>
<li>Une connaissance des frameworks de d&eacute;veloppement web serait un atout</li>
<li>Capacit&eacute; &agrave; s&rsquo;int&eacute;grer et &agrave; travailler &agrave; une &eacute;quipe de design et de d&eacute;veloppement</li>
</ul>

<h2>Lieu du stage</h2>

<p>En raison des circonstances sanitaires, le stage se d&eacute;roulera en t&eacute;l&eacute;travail. Il implique la participation d&rsquo;une &eacute;quipe de chercheurs du Laboratoire d&rsquo;informatique formelle de l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi, sous l&rsquo;&eacute;gide de la Chaire de recherche du Canada en sp&eacute;cification, test et v&eacute;rification de syst&egrave;mes.
&Agrave; propos d&rsquo;Eckinox</p>

<p>Eckinox, c&rsquo;est une &eacute;quipe de 30 professionnels du num&eacute;rique qui collaborent main dans la main pour donner le pouvoir aux individus d&rsquo;accomplir leur vision d&rsquo;affaires. Nous y arrivons gr&acirc;ce &agrave; une approche unique et gr&acirc;ce &agrave; notre &eacute;quipe de designers, d&eacute;veloppeurs, strat&egrave;ges et vid&eacute;astes d&eacute;di&eacute;e &agrave; cr&eacute;er des exp&eacute;riences num&eacute;riques hors du commun. Plus d&rsquo;information: https://www.eckinox.ca</p>

<h2>&Agrave; propos du LIF</h2>

<p>Le LIF est une unit&eacute; de recherche de l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi. Trois professeurs-chercheurs et plus d&rsquo;une dizaine d&rsquo;&eacute;tudiants de tous les cycles y travaillent sur des projets de recherche appliqu&eacute;e tournant autour du test, de la v&eacute;rification et de la s&eacute;curit&eacute;. Le LIF est entre autres reconnu pour le d&eacute;veloppement de Cornipickle (le logiciel faisant l&rsquo;objet de ce stage) ainsi que de BeepBeep, une librairie de traitement de flux d&rsquo;&eacute;v&eacute;nements et d&rsquo;analyse de logs open source qui a &eacute;t&eacute; appliqu&eacute;e &agrave; de nombreux probl&egrave;mes informatiques concrets, allant de la d&eacute;tection de bugs dans les jeux vid&eacute;o &agrave; la v&eacute;rification de sp&eacute;cifications formelles dans des logs de sources diverses. Le LIF dispose d&rsquo;installations modernes au Pavillon principal de l&rsquo;UQAC et a cumul&eacute; plus d&rsquo;un million de dollars en fonds de recherche de toutes provenances depuis sa cr&eacute;ation. Plus d&rsquo;information: https://liflab.ca</p>

<!-- :wrap=soft: -->

								</section>
							</div>
							<div class="col-4 col-12-medium col-12-small">
								<section>
									<h2>Publications r&eacute;centes</h2>
									<ul class="postlist">
<li>
<a href="../posts/fr/LIF25-M1">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: &Eacute;valuation des comp&eacute;tences cliniques par le monitoring et l&rsquo;analyse de logs (LIF25-M1)</a><br>
<span class="postinfo">2025/02/07 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-D4">Candidats au doctorat recherch&eacute;s: Suivi de la gestion de projet d'un jeu vid&eacute;o par l'analyse des fichiers de journalisation (LIF24-D4)</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24">&Eacute;tudiants recherch&eacute;s pour plusieurs projets de ma&icirc;trise et de doctorat</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-D3">Candidats au doctorat recherch&eacute;s: D&eacute;tection d&rsquo;anomalies dans un syst&egrave;me de requ&ecirc;tes d&rsquo;identit&eacute; (LIF24-D3)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-M1">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: Monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o (LIF24-M1)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
</ul>

								</section>
															</div>
						</div>
					</div>
				</div>

					<!-- Footer -->
				<div id="footer-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">
								<div id="copyright">
									&copy;Laboratoire d'informatique formelle. Tous droits r&eacute;serv&eacute;s. | Design: <a href="http://html5up.net">HTML5 UP</a> | Powered by <a href="https://sylvainhalle.github.io/FantasticWindmill">Fantastic Windmill</a>
								</div>

							</div>
						</div>
					</div>
				</div>

		</div>
		
		<!-- Scripts -->
<script src="../../assets/js/jquery.min.js"></script>
<script src="../../assets/js/browser.min.js"></script>
<script src="../../assets/js/breakpoints.min.js"></script>
<script src="../../assets/js/util.js"></script>
<script src="../../assets/js/main.js"></script>
<!-- Matomo -->
<script>
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//leduotang.ca/matomo/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '5']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
	</body>
</html>