<!DOCTYPE HTML>
<!--
	Minimaxing by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)
--><html lang="fr">
	<head>

		<title>&Eacute;tudiants recherch&eacute;s pour plusieurs projets de ma&icirc;trise et de doctorat - LIF</title>
<meta charset="utf-8">
<meta name="author" content="Sylvain Hall&eacute;">
<meta name="DC.date" content="1740239795">
<meta name="description" content="Le Laboratoire d&rsquo;informatique formelle de l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi est &agrave; la recherche de candidats pour plusieurs projets financ&eacute;s de niveau ma&icirc;trise et doctorat d&eacute;butant &agrave; l&rsquo;&eacute;t&eacute; et &agrave; l&rsquo;automne 2024. La Chaire de recherche du Canada en sp&eacute;cification, test et v&eacute;rification de syst&egrave;mes informatiques assure le financement des &eacute;tudiants, sous la forme d&rsquo;une bourse d&rsquo;&eacute;tudes, pour la dur&eacute;e du projet (2 ans pour la ma&icirc;trise, 3 ans pour le doctorat).">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="robots" content="index,follow">
<link rel="icon" href="../../images/cropped-lif-carre-1024.png" type="image/png">		<link rel="stylesheet" href="../../assets/css/main.css">
		<link rel="stylesheet" href="../../custom.css">
	</head>
	<body>
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">

								<header id="header">
																	<h1><a href="../../index" id="logo"><span style="display:none">LIF</span></a></h1>
									<nav id="nav">
										<a href="../../index">Accueil</a>
										<a href="../../recherche">Recherche</a>
										<a href="../../membres">Membres</a>
										<a href="../../posts/liste">Nouvelles</a>
										<a href="../../contact-fr">Contact</a>
										<a href="../../posts/en/LIF24">English</a>
									</nav>
																</header>

							</div>
						</div>
					</div>
				</div>
			<!-- Main -->
				<div id="main">
				  <div class="container">
						<div class="row main-row">
							<div class="col-8 col-12-medium col-12-small postcontent">
								<section>
								    



<h1>&Eacute;tudiants recherch&eacute;s pour plusieurs projets de ma&icirc;trise et de doctorat</h1>
<p class="postinfo">2024/02/02 par Sylvain Hall&eacute;</p>



<div class="postimage"><img src="../shutterstock_145577401-small.webp" alt="Post image"></div>




<p>Le Laboratoire d&rsquo;informatique formelle de l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi est &agrave; la recherche de candidats pour plusieurs projets financ&eacute;s de niveau ma&icirc;trise et doctorat d&eacute;butant &agrave; l&rsquo;&eacute;t&eacute; et &agrave; l&rsquo;automne 2024. La Chaire de recherche du Canada en sp&eacute;cification, test et v&eacute;rification de syst&egrave;mes informatiques assure le financement des &eacute;tudiants, sous la forme d&rsquo;une bourse d&rsquo;&eacute;tudes, pour la dur&eacute;e du projet (2 ans pour la ma&icirc;trise, 3 ans pour le doctorat).</p>

<h2>Projets propos&eacute;s</h2>

<p>Cliquer sur les liens ci-dessous pour une description plus d&eacute;taill&eacute;e de chacun des projets.</p>

<ul>
<li>
<a href="../../posts/fr/LIF24-M1">LIF24-M1</a> Monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o. Vise &agrave; utiliser le simulateur machinations.io pour mod&eacute;liser l&rsquo;&eacute;conomie de jeux vid&eacute;o, simuler des sc&eacute;narios pour &eacute;quilibrer leur difficult&eacute;, et exporter les donn&eacute;es pour analyse et transformation avec la librairie BeepBeep.</li>
<li>
<a>LIF24-D1</a> Test et v&eacute;rification pour l&rsquo;event stream processing. Vise &agrave; d&eacute;velopper la th&eacute;orie, les techniques et les outils pour le test et la v&eacute;rification formelle de programmes de flux, en particulier pour des pipelines de traitement dans des API comme BeepBeep.</li>
<li>
<a>LIF24-D2</a> &Eacute;valuation des comp&eacute;tences cliniques par le monitoring et l&rsquo;analyse de logs. Vise &agrave; formaliser, impl&eacute;menter, et &eacute;valuer les m&eacute;canismes de mesure des comp&eacute;tences cliniques des infirmi&egrave;res par l&rsquo;analyse de leurs actions dans un jeu, en utilisant des techniques d&rsquo;analyse de logs et de m&eacute;thodes formelles pour produire des indicateurs explicables pour l&rsquo;am&eacute;lioration continue.</li>
<li>
<a href="../../posts/fr/LIF24-D3">LIF24-D3</a> D&eacute;tection d&rsquo;anomalies dans un syst&egrave;me de requ&ecirc;tes d&rsquo;identit&eacute;. Vise &agrave; analyser en temps r&eacute;el les logs de requ&ecirc;tes d&rsquo;identit&eacute; dans un syst&egrave;me s&eacute;curis&eacute; bas&eacute; sur la blockchain pour d&eacute;tecter anomalies et comportements suspicieux, en utilisant la logique temporelle lin&eacute;aire et la logique modale &eacute;pist&eacute;mique pour la mod&eacute;lisation formelle et la v&eacute;rification pratique via un moniteur ou contrat intelligent.</li>
<li>
<a href="../../posts/fr/LIF24-D4">LIF24-D4</a> Suivi de la gestion de projet d&rsquo;un jeu vid&eacute;o par l&rsquo;analyse des fichiers de journalisation. Vise &agrave; d&eacute;velopper des m&eacute;thodes automatiques pour traiter les fichiers de journalisation dans le d&eacute;veloppement de jeux vid&eacute;o, afin de g&eacute;n&eacute;rer des alertes pour pr&eacute;venir les probl&egrave;mes et &eacute;valuer la sant&eacute; du projet, ainsi qu&rsquo;&agrave; identifier et ajuster automatiquement les &eacute;l&eacute;ments de journalisation n&eacute;cessaires.</li>
</ul>

<p>Les personnes souhaitant postuler sont invit&eacute;es &agrave; remplir le formulaire en ligne &agrave; l&rsquo;adresse https://zfrmz.com/BGLMrz4QFYzkIOZxVtpD en fournissant les &eacute;l&eacute;ments demand&eacute;s.</p>

<h2>Pr&eacute;sentation de l'&eacute;tablissement et du labo d&rsquo;accueil</h2>

<p>L&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi (UQAC) fait partie du plus grand r&eacute;seau universitaire au Canada. Elle est situ&eacute;e dans la r&eacute;gion francophone du Saguenay&ndash;Lac-Saint-Jean, r&eacute;put&eacute;e pour la beaut&eacute; de son fjord et la majest&eacute; de sa nature environnante. L&rsquo;UQAC accueille chaque ann&eacute;e 6 500 &eacute;tudiants, dont plus de 1 000 provenant de 50 pays diff&eacute;rents. Le programme de recherche en informatique est particuli&egrave;rement dynamique; il est l&rsquo;h&ocirc;te de deux chaires de recherche du Canada, comprend actuellement une vingtaine de professeurs, 30 doctorants et boursiers postdoctoraux et plus de 100 &eacute;tudiants &agrave; la ma&icirc;trise.</p>

<p>Le travail de doctorat se d&eacute;roulera au Laboratoire d&rsquo;informatique formelle, sous la supervision du Pr. Sylvain Hall&eacute;, titulaire de la Chaire de recherche du Canada sur les tests, la sp&eacute;cifications et la v&eacute;rification de syst&egrave;mes informatiques. Le LIF est sp&eacute;cialis&eacute; dans l&rsquo;application de m&eacute;thodes formelles au test et &agrave; la v&eacute;rification de divers syst&egrave;mes logiciels. Les projets ant&eacute;rieurs des membres du corps professoral du LIF ont &eacute;t&eacute; r&eacute;alis&eacute;s en collaboration avec de nombreuses entreprises, dont Ericsson, Industrielle Alliance, Ubisoft LaForge, Devicom et Eckinox M&eacute;dia.</p>

<p>La recherche au LIF est reconnue internationalement et contribue au d&eacute;veloppement d&rsquo;outils logiciels concrets et de haute qualit&eacute; fond&eacute;s sur des bases math&eacute;matiques solides. Les projets notables de longue date d&eacute;velopp&eacute;s au LIF incluent le moteur de traitement de flux d&rsquo;&eacute;v&eacute;nements BeepBeep 3 [2], le syst&egrave;me de surveillance de la blockchain Artichoke [3] et la biblioth&egrave;que de lignage de donn&eacute;es Petit Poucet [4]. Toutes ces initiatives ont &eacute;t&eacute; r&eacute;compens&eacute;es et publi&eacute;es dans des conf&eacute;rences internationales de premier plan au cours de la derni&egrave;re d&eacute;cennie.</p>

<h2>R&eacute;f&eacute;rences</h2>

<ol>
<li>A. B&eacute;dard, S. Hall&eacute;. (2021). Model Checking of Stream Processing Pipelines. In Proc. TIME, 5:1-5:17. DOI 10.4230/LIPIcs.TIME.2021.5</li>
<li>S. Hall&eacute;. (2018). Event Stream Processing with BeepBeep 3: Log Crunching and Analysis Made Easy. Presses de l'Universit&eacute; du Qu&eacute;bec, ISBN 978-2-7605-5101-5</li>
<li>S. Hall&eacute;, R. Khoury, A. El-Hokayem, Y. Falcone. (2016). Decentralized Enforcement of Artifact Lifecycles. In Proc. EDOC, 1-10. DOI 10.1109/EDOC.2016.7579380</li>
<li>S. Hall&eacute;, H. Tremblay. (2021). Foundations of Fine-Grained Explainability. In Proc. CAV, Springer LNCS 12760, 500-523. DOI 10.1007/978-3-030-81688-9_24</li>
</ol>

								</section>
							</div>
							<div class="col-4 col-12-medium col-12-small">
								<section>
									<h2>Publications r&eacute;centes</h2>
									<ul class="postlist">
<li>
<a href="../posts/fr/LIF25-M1">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: &Eacute;valuation des comp&eacute;tences cliniques par le monitoring et l&rsquo;analyse de logs (LIF25-M1)</a><br>
<span class="postinfo">2025/02/07 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-D4">Candidats au doctorat recherch&eacute;s: Suivi de la gestion de projet d'un jeu vid&eacute;o par l'analyse des fichiers de journalisation (LIF24-D4)</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24">&Eacute;tudiants recherch&eacute;s pour plusieurs projets de ma&icirc;trise et de doctorat</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-D3">Candidats au doctorat recherch&eacute;s: D&eacute;tection d&rsquo;anomalies dans un syst&egrave;me de requ&ecirc;tes d&rsquo;identit&eacute; (LIF24-D3)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../posts/fr/LIF24-M1">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: Monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o (LIF24-M1)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
</ul>

								</section>
																<section>
								    <h2>Keywords</h2>
								    <ul>
<li>postes</li>
<li>&eacute;tudiants</li>
</ul>
								</section>
															</div>
						</div>
					</div>
				</div>

					<!-- Footer -->
				<div id="footer-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">
								<div id="copyright">
									&copy;Laboratoire d'informatique formelle. Tous droits r&eacute;serv&eacute;s. | Design: <a href="http://html5up.net">HTML5 UP</a> | Powered by <a href="https://sylvainhalle.github.io/FantasticWindmill">Fantastic Windmill</a>
								</div>

							</div>
						</div>
					</div>
				</div>

		</div>
		
		<!-- Scripts -->
<script src="../../assets/js/jquery.min.js"></script>
<script src="../../assets/js/browser.min.js"></script>
<script src="../../assets/js/breakpoints.min.js"></script>
<script src="../../assets/js/util.js"></script>
<script src="../../assets/js/main.js"></script>
<!-- Matomo -->
<script>
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//leduotang.ca/matomo/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '5']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
	</body>
</html>