<!DOCTYPE HTML>
<!--
	Minimaxing by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)
--><html lang="en">
	<head>

		<title>Open PhD Position in anomaly detection in an identity query management system (LIF24-D3) - LIF</title>
<meta charset="utf-8">
<meta name="author" content="Sylvain Hall&eacute;">
<meta name="description" content="The Formal Computer Science Laboratory (LIF) at Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi is seeking an outstanding PhD candidate to fill a 3-year funded position on anomaly detection in an identity query management system.">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="robots" content="index,follow">
<link rel="icon" href="../images/cropped-lif-carre-1024.png" type="image/png">		<link rel="stylesheet" href="../assets/css/main.css">
		<link rel="stylesheet" href="../custom.css">
	</head>
	<body>
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">

								<header id="header">
																	<h1><a href="home" id="logo"><span style="display:none">LIF</span></a></h1>
									<nav id="nav">
										<a href="../home">Home</a>
										<a href="../research">Research</a>
										<a href="../staff">Staff</a>
										<a href="../posts/list">News</a>
										<a href="../contact-en">Contact</a>
										<a href="../posts/LIF24-D3-fr">Fran&ccedil;ais</a>
									</nav>
																</header>

							</div>
						</div>
					</div>
				</div>
			<!-- Main -->
				<div id="main">
				  <div class="container">
						<div class="row main-row">
							<div class="col-8 col-12-medium col-12-small postcontent">
								<section>
								    



<h1>Open PhD Position in anomaly detection in an identity query management system (LIF24-D3)</h1>
<p class="postinfo">2024/01/30 by Sylvain Hall&eacute;</p>



<div class="postimage"><img src="cyber.webp" alt="Post image"></div>




<p>The Formal Computer Science Laboratory (LIF) at Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi is seeking an outstanding PhD candidate to fill a 3-year funded position on anomaly detection in an identity query management system.</p>

<ul>
<li>Date d&rsquo;entr&eacute;e en fonction: 1er septembre 2024 (ou plus tard)</li>
</ul>

<h2>Project Description</h2>

<p>An <em>identity query</em> is any request for personal information made by an entity about an individual. These queries can take various forms and have a varying level of precision; for instance, asking if a person resides in Canada and asking for a person&rsquo;s exact address are two identity queries, one of which is more precise than the other.</p>

<p>The project considers a system that manages the secure exchange of identity queries between a large number of individuals and organizations, and in which all queries are logged in a decentralized blockchain-type medium. The objective is to detect possible anomalies, policy violations or suspicious behavior of certain agents by analyzing identity query logs produced in real time. The project includes both a formal component, in which identity queries and their properties will be modeled using two modal logics, namely linear temporal logic and epistemic modal logic. It also has a practical aspect, where the formally defined properties will be verified in real time by the implementation of a monitor integrated into the platform of a commercial product in production in a large company.</p>

<h2>Research Areas</h2>

<ul>
<li>Cybersercurity</li>
<li>Privacy protection</li>
<li>Runtime monitoring</li>
<li>Testing and verification</li>
</ul>

<h2>Environment</h2>

<p>L&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi (UQAC) fait partie du plus grand r&eacute;seau universitaire au Canada. Elle est situ&eacute;e dans la r&eacute;gion francophone du Saguenay&ndash;Lac-Saint-Jean, r&eacute;put&eacute;e pour la beaut&eacute; de son fjord et la majest&eacute; de sa nature environnante. L&rsquo;UQAC accueille chaque ann&eacute;e 6 500 &eacute;tudiants, dont plus de 1 000 provenant de 50 pays diff&eacute;rents. Le programme de recherche en informatique est particuli&egrave;rement dynamique; il est l&rsquo;h&ocirc;te de deux chaires de recherche du Canada, comprend actuellement une vingtaine de professeurs, 30 doctorants et boursiers postdoctoraux et plus de 100 &eacute;tudiants &agrave; la ma&icirc;trise.</p>

<p>Le travail de doctorat se d&eacute;roulera au Laboratoire d&rsquo;informatique formelle, sous la supervision du Pr. Sylvain Hall&eacute;, titulaire de la Chaire de recherche du Canada sur les tests, la sp&eacute;cifications et la v&eacute;rification de syst&egrave;mes informatiques. Le LIF est sp&eacute;cialis&eacute; dans l&rsquo;application de m&eacute;thodes formelles au test et &agrave; la v&eacute;rification de divers syst&egrave;mes logiciels. Les projets ant&eacute;rieurs des membres du corps professoral du LIF ont &eacute;t&eacute; r&eacute;alis&eacute;s en collaboration avec de nombreuses entreprises, dont Ericsson, Industrielle Alliance, Ubisoft LaForge, Devicom et Eckinox M&eacute;dia.</p>

<p>La recherche au LIF est reconnue internationalement et contribue au d&eacute;veloppement d&rsquo;outils logiciels concrets et de haute qualit&eacute; fond&eacute;s sur des bases math&eacute;matiques solides. Les projets notables de longue date d&eacute;velopp&eacute;s au LIF incluent le moteur de traitement de flux d&rsquo;&eacute;v&eacute;nements BeepBeep 3, le syst&egrave;me de surveillance de la blockchain Artichoke et la biblioth&egrave;que de lignage de donn&eacute;es Petit Poucet. Toutes ces initiatives ont &eacute;t&eacute; r&eacute;compens&eacute;es et publi&eacute;es dans des conf&eacute;rences internationales de premier plan au cours de la derni&egrave;re d&eacute;cennie.</p>

<h2>Required Qualifications</h2>

<p>A very good Diploma or Master university degree in computer science, informatics, business informatics, mathematics, or a related discipline is expected. We further seek the following qualifications:</p>

<ul>
<li>Very good formal knowledge: theoretical computer science, mathematical logic. A background in mathematics is considered a plus.</li>
<li>Good programming skills; knowledge of Java is considered a plus.</li>
<li>Knowledge in blockchain technology or cryptography is a plus.</li>
<li>Very good scientific communication and writing skills.</li>
<li>Very good knowledge in English communication and writing.</li>
<li>In-depth interest in scientific problems and the motivation for independent and goal-oriented research.</li>
</ul>

<h2>Funding</h2>

<p>Funding of this position is ensured by grants from the Canada Research Chair on Software Specification, Testing and Verification and the Natural Science and Engineering Research Council of Canada. The candidate will receive a scholarship of a net amount of 27,000 CAD per year for three years.</p>

<h2>Application Procedure</h2>

<p>Prospective applicants are asked to fill the form at https://zfrmz.com/BGLMrz4QFYzkIOZxVtpD?zf_lang=en, make sure to specify project LIF24-D3, and provide the following documents:</p>

<ul>
<li>Letter of motivation</li>
<li>Curriculum vitae, including a) list of publications if any; b) names and contact information of at least two references</li>
<li>Transcripts of undergraduate and graduate studies</li>
<li>A copy of the Master&rsquo;s thesis, if it has been submitted</li>
</ul>

<p>Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi is committed to equity, diversity and inclusion at all steps of its students&rsquo; curriculum; candidates from under-represented groups are especially encouraged to apply. Applications will be evaluated by a panel of three UQAC faculty members by focusing on the criteria mentioned above. Shortlisted applications will be called for an online interview to further assess their technical and communication skills.</p>

<!-- :wrap=soft: -->

								</section>
							</div>
							<div class="col-4 col-12-medium col-12-small">
								<section>
									<h2>Recent posts</h2>
									<ul class="postlist">
<li>
<a href="../../public_html/posts/LIF25-M1-en">Two open M.Sc. positions in evaluation of clinical skills through monitoring and analysis of logs (LIF25-M1)</a><br>
<span class="postinfo">2025/02/07 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/LIF24-en">Students wanted for several master's and doctoral projects</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/LIF24-D3-en">Open PhD Position in anomaly detection in an identity query management system (LIF24-D3)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/LIF24-M1-en">Open M.Sc. Position in monitoring of a video game economy (LIF24-M1)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/formalise21-award">A PhD student from LIF earns a Best Paper Award</a><br>
<span class="postinfo">2021/10/02 by Sylvain Hall&eacute;</span>
</li>
</ul>

								</section>
															</div>
						</div>
					</div>
				</div>

					<!-- Footer -->
				<div id="footer-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">
								<div id="copyright">
									&copy;Laboratoire d'informatique formelle. All rights reserved. | Design: <a href="http://html5up.net">HTML5 UP</a> | Powered by <a href="https://sylvainhalle.github.io/FantasticWindmill">Fantastic Windmill</a>
								</div>

							</div>
						</div>
					</div>
				</div>

		</div>
		
		<!-- Scripts -->
<script src="assets/js/jquery.min.js"></script>
<script src="assets/js/browser.min.js"></script>
<script src="assets/js/breakpoints.min.js"></script>
<script src="assets/js/util.js"></script>
<script src="assets/js/main.js"></script>
<!-- Matomo -->
<script>
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//leduotang.ca/matomo/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '5']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
	</body>
</html>