<!DOCTYPE HTML>
<!--
	Minimaxing by HTML5 UP
	html5up.net | @ajlkn
	Free for personal and commercial use under the CCA 3.0 license (html5up.net/license)
--><html lang="fr">
	<head>

		<title>Candidats &agrave; la ma&icirc;trise recherch&eacute;s: Monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o (LIF24-M1) - LIF</title>
<meta charset="utf-8">
<meta name="author" content="Sylvain Hall&eacute;">
<meta name="description" content="Le Laboratoire d&rsquo;informatique formelle &agrave; l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi recherche d&rsquo;excellents candidats au doctorat pour un projet de doctorat financ&eacute; de 3 ans pour l&rsquo;&eacute;valuation des comp&eacute;tences cliniques par le monitoring et l&rsquo;analyse de logs.">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
<meta name="robots" content="index,follow">
<link rel="icon" href="../images/cropped-lif-carre-1024.png" type="image/png">		<link rel="stylesheet" href="../assets/css/main.css">
		<link rel="stylesheet" href="../custom.css">
	</head>
	<body>
		<div id="page-wrapper">

			<!-- Header -->
				<div id="header-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">

								<header id="header">
																	<h1><a href="../index" id="logo"><span style="display:none">LIF</span></a></h1>
									<nav id="nav">
										<a href="../index">Accueil</a>
										<a href="../recherche">Recherche</a>
										<a href="../membres">Membres</a>
										<a href="../posts/liste">Nouvelles</a>
										<a href="../contact-fr">Contact</a>
										<a href="../posts/LIF24-M1-en">English</a>
									</nav>
																</header>

							</div>
						</div>
					</div>
				</div>
			<!-- Main -->
				<div id="main">
				  <div class="container">
						<div class="row main-row">
							<div class="col-8 col-12-medium col-12-small postcontent">
								<section>
								    



<h1>Candidats &agrave; la ma&icirc;trise recherch&eacute;s: Monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o (LIF24-M1)</h1>
<p class="postinfo">2024/01/30 par Sylvain Hall&eacute;</p>



<div class="postimage"><img src="machinations.webp" alt="Post image"></div>




<p>Le Laboratoire d&rsquo;informatique formelle &agrave; l&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi recherche d&rsquo;excellents candidats &agrave; la ma&icirc;trise pour un projet financ&eacute; de 2 ans concernant le monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o.</p>

<ul>
<li>Date d&rsquo;entr&eacute;e en fonction: 1er septembre 2024 (ou plus tard)</li>
</ul>

<h2>Description du sujet</h2>

<p>Une mani&egrave;re possible de s&rsquo;assurer de l&rsquo;&eacute;quilibre d&rsquo;un jeu vid&eacute;o consiste &agrave; mod&eacute;liser son &laquo; &eacute;conomie &raquo; (soit le m&eacute;canisme par lequel des ressources sont distribu&eacute;es, acquises ou d&eacute;pens&eacute;es &agrave; l&rsquo;int&eacute;rieur de l&rsquo;univers du jeu) au moyen d&rsquo;un simulateur, puis &agrave; g&eacute;n&eacute;rer un grand nombre d&rsquo;ex&eacute;cutions simul&eacute;es afin d&rsquo;en recueillir des statistiques. Par exemple, si on d&eacute;couvre que 90% des simulations se terminent en &eacute;chec, ou r&eacute;sultent en l&rsquo;&eacute;puisement d&rsquo;une ressource n&eacute;cessaire &agrave; la poursuite du jeu, on pourra chercher &agrave; ajuster les param&egrave;tres de l&rsquo;&eacute;conomie afin de r&eacute;duire son niveau de difficult&eacute;.</p>

<p>Le logiciel machinations.io est un simulateur d&rsquo;&eacute;conomie de jeux populaire et tr&egrave;s flexible permettant de mod&eacute;liser une vari&eacute;t&eacute; de types de jeux. Le premier objectif de ce projet consiste &agrave; apprendre le fonctionnement du logiciel, mod&eacute;liser des &eacute;conomies de jeu simples, ex&eacute;cuter des simulations et comprendre les fonctionnalit&eacute;s de calcul de statistiques offertes par le logiciel. Un second objectif du projet consiste &agrave; exporter les donn&eacute;es temps r&eacute;el produites par la simulation d&rsquo;une &eacute;conomie &agrave; l&rsquo;ext&eacute;rieur du logiciel, et de les relier comme source de donn&eacute;es &agrave; la librairie de traitement de flux d&rsquo;&eacute;v&eacute;nements BeepBeep afin d&rsquo;y effectuer des transformations simples.</p>

<h2>Financement</h2>

<p>21 000$ par ann&eacute;e pour une p&eacute;riode de deux ans</p>

<h2>Domaine(s) de recherche</h2>

<ul>
<li>Jeux vid&eacute;o</li>
<li>Analyse de logs</li>
</ul>

<h2>Pr&eacute;sentation &eacute;tablissement et labo d&rsquo;accueil</h2>

<p>L&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi (UQAC) fait partie du plus grand r&eacute;seau universitaire au Canada. Elle est situ&eacute;e dans la r&eacute;gion francophone du Saguenay&ndash;Lac-Saint-Jean, r&eacute;put&eacute;e pour la beaut&eacute; de son fjord et la majest&eacute; de sa nature environnante. L&rsquo;UQAC accueille chaque ann&eacute;e 6 500 &eacute;tudiants, dont plus de 1 000 provenant de 50 pays diff&eacute;rents. Le programme de recherche en informatique est particuli&egrave;rement dynamique; il est l&rsquo;h&ocirc;te de deux chaires de recherche du Canada, comprend actuellement une vingtaine de professeurs, 30 doctorants et boursiers postdoctoraux et plus de 100 &eacute;tudiants &agrave; la ma&icirc;trise.</p>

<p>Le travail de doctorat se d&eacute;roulera au Laboratoire d&rsquo;informatique formelle, sous la supervision du Pr. Sylvain Hall&eacute;, titulaire de la Chaire de recherche du Canada sur les tests, la sp&eacute;cifications et la v&eacute;rification de syst&egrave;mes informatiques. Le LIF est sp&eacute;cialis&eacute; dans l&rsquo;application de m&eacute;thodes formelles au test et &agrave; la v&eacute;rification de divers syst&egrave;mes logiciels. Les projets ant&eacute;rieurs des membres du corps professoral du LIF ont &eacute;t&eacute; r&eacute;alis&eacute;s en collaboration avec de nombreuses entreprises, dont Ericsson, Industrielle Alliance, Ubisoft LaForge, Devicom et Eckinox M&eacute;dia.</p>

<p>La recherche au LIF est reconnue internationalement et contribue au d&eacute;veloppement d&rsquo;outils logiciels concrets et de haute qualit&eacute; fond&eacute;s sur des bases math&eacute;matiques solides. Les projets notables de longue date d&eacute;velopp&eacute;s au LIF incluent le moteur de traitement de flux d&rsquo;&eacute;v&eacute;nements BeepBeep 3, le syst&egrave;me de surveillance de la blockchain Artichoke et la biblioth&egrave;que de lignage de donn&eacute;es Petit Poucet. Toutes ces initiatives ont &eacute;t&eacute; r&eacute;compens&eacute;es et publi&eacute;es dans des conf&eacute;rences internationales de premier plan au cours de la derni&egrave;re d&eacute;cennie.</p>

<h2>Profil de la candidature</h2>

<p>Un tr&egrave;s bon dipl&ocirc;me de ma&icirc;trise universitaire en informatique, informatique de gestion, math&eacute;matiques ou dans une discipline connexe est attendu. Nous recherchons en outre les qualifications suivantes:</p>

<ul>
<li>Bonnes comp&eacute;tences en programmation (Python, C#, C++)</li>
<li>Une connaissance du d&eacute;veloppement de jeux vid&eacute;o ou de la programmation Java seront consid&eacute;r&eacute;es comme des atouts</li>
<li>Aptitudes &agrave; la communication scientifique et &agrave; la r&eacute;daction.</li>
<li>Int&eacute;r&ecirc;t marqu&eacute; pour les probl&egrave;mes scientifiques et motivation &agrave; mener une recherche ind&eacute;pendante et cibl&eacute;e.</li>
</ul>

<p>L&rsquo;Universit&eacute; du Qu&eacute;bec &agrave; Chicoutimi s&rsquo;engage pour l&rsquo;&eacute;quit&eacute;, la diversit&eacute; et l&rsquo;inclusion &agrave; toutes les &eacute;tapes du cursus de ses &eacute;tudiants; les personnes des groupes sous-repr&eacute;sent&eacute;s sont particuli&egrave;rement encourag&eacute;es &agrave; postuler. Les candidatures seront &eacute;valu&eacute;es par un panel de trois membres du corps professoral de l&rsquo;UQAC en se concentrant sur les crit&egrave;res mentionn&eacute;s ci-dessus. Les personnes s&eacute;lectionn&eacute;es dans un premier temps seront convoqu&eacute;es pour un entretien en ligne afin d&rsquo;&eacute;valuer davantage leurs comp&eacute;tences techniques et de communication.</p>

<h2>El&eacute;ments &agrave; fournir pour la candidature</h2>

<p>Les personnes souhaitant sont invit&eacute;s &agrave; remplir le formulaire en ligne &agrave; l&rsquo;adresse https://zfrmz.com/BGLMrz4QFYzkIOZxVtpD en prenant soin de choisir le concours LIF24-M1 et en fournissant les documents suivants:</p>

<ul>
<li>Lettre de motivation</li>
<li>Curriculum vitae, incluant a) la liste des publications le cas &eacute;ch&eacute;ant; b) les noms et coordonn&eacute;es d&rsquo;au moins deux r&eacute;f&eacute;rences</li>
<li>Relev&eacute; de notes du baccalaur&eacute;at (licence) et de la ma&icirc;trise (master)</li>
</ul>

<!-- :wrap=soft: -->

								</section>
							</div>
							<div class="col-4 col-12-medium col-12-small">
								<section>
									<h2>Publications r&eacute;centes</h2>
									<ul class="postlist">
<li>
<a href="../../public_html/posts/LIF25-M1-fr">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: &Eacute;valuation des comp&eacute;tences cliniques par le monitoring et l&rsquo;analyse de logs (LIF25-M1)</a><br>
<span class="postinfo">2025/02/07 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/LIF24-D4-fr">Candidats au doctorat recherch&eacute;s: Suivi de la gestion de projet d'un jeu vid&eacute;o par l'analyse des fichiers de journalisation (LIF24-D4)</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/LIF24-fr">&Eacute;tudiants recherch&eacute;s pour plusieurs projets de ma&icirc;trise et de doctorat</a><br>
<span class="postinfo">2024/02/02 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/LIF24-D3-fr">Candidats au doctorat recherch&eacute;s: D&eacute;tection d&rsquo;anomalies dans un syst&egrave;me de requ&ecirc;tes d&rsquo;identit&eacute; (LIF24-D3)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
<li>
<a href="../../public_html/posts/LIF24-M1-fr">Candidats &agrave; la ma&icirc;trise recherch&eacute;s: Monitoring de l&rsquo;&eacute;conomie des jeux vid&eacute;o (LIF24-M1)</a><br>
<span class="postinfo">2024/01/30 by Sylvain Hall&eacute;</span>
</li>
</ul>

								</section>
															</div>
						</div>
					</div>
				</div>

					<!-- Footer -->
				<div id="footer-wrapper">
					<div class="container">
						<div class="row">
							<div class="col-12">
								<div id="copyright">
									&copy;Laboratoire d'informatique formelle. Tous droits r&eacute;serv&eacute;s. | Design: <a href="http://html5up.net">HTML5 UP</a> | Powered by <a href="https://sylvainhalle.github.io/FantasticWindmill">Fantastic Windmill</a>
								</div>

							</div>
						</div>
					</div>
				</div>

		</div>
		
		<!-- Scripts -->
<script src="assets/js/jquery.min.js"></script>
<script src="assets/js/browser.min.js"></script>
<script src="assets/js/breakpoints.min.js"></script>
<script src="assets/js/util.js"></script>
<script src="assets/js/main.js"></script>
<!-- Matomo -->
<script>
  var _paq = window._paq = window._paq || [];
  /* tracker methods like "setCustomDimension" should be called before "trackPageView" */
  _paq.push(['trackPageView']);
  _paq.push(['enableLinkTracking']);
  (function() {
    var u="//leduotang.ca/matomo/";
    _paq.push(['setTrackerUrl', u+'matomo.php']);
    _paq.push(['setSiteId', '5']);
    var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
    g.async=true; g.src=u+'matomo.js'; s.parentNode.insertBefore(g,s);
  })();
</script>
<!-- End Matomo Code -->
	</body>
</html>